#函数的参数
'''
1.位置传参
参数的变量名 符合标识符命名规则
参数个数不受限制,参数之间用逗号隔开
位置参数(必须参数) --- 传入参数的顺序个数要一致
2.关键字参数---传参时通过'键=值'的形似和加以指定,消除了参数的顺序需求
        注:位置参数与关键字参数连用时,位置参数要卸载关键字参数的前面
3.缺省参数(默认参数) --- 可传入也可不传入
        注:位置参数与默认参数连用时,位置参数要卸载默认参数的前面
4.不定长参数 --- 不确定传入几个参数
5.包裹位置传递 --- (*args),接收到多个数据后变成元组传递到函数中
6.包裹关键字传递 --- (**kwargs),接收到多个数据后变成字典传入到函数中
'''
# def a(name,age,sex):
#     print(f'您的名字是{name},年龄是{age},性别为{sex}')
# a('name',18,'男')      #顺序必须对应
#
# # 关键字参数---传参时通过'键=值'的形似和加以指定,消除了参数的顺序需求
# def a(name,age,sex):
#     print(f'您的名字是{name},年龄是{age},性别为{sex}')
# a(age=18,sex='男',name='tom')   #指定形参的值为多少 顺序可乱
#
# # 位置参数与关键字参数连用时,位置参数要卸载关键字参数的前面
# def a(name,age,sex):
#     print(f'您的名字是{name},年龄是{age},性别为{sex}')
# a('tom',sex='男',age=18)
#
# # 缺省参数(默认参数) --- 可传入也可不传入
# def a(name,age,sex='男'):
#     print(f'您的名字是{name},年龄是{age},性别为{sex}')
# a('tom',18)             #您的名字是tom,年龄是18,性别为男
#
# def a(name,age,sex='男'):
#     print(f'您的名字是{name},年龄是{age},性别为{sex}')
# a('tom',18,'女')        #您的名字是tom,年龄是18,性别为女
#
#
# # 不定长参数
# # 包裹位置传递
# def testB(*args):
#     print(args)
# testB(1,2,3,4,'qwer')             #(1, 2, 3, 4, 'qwer')
#
#
# # 包裹关键字传参
# def testB(**kwargs):
#     print(kwargs)
# testB(name='tom',age=10)        #{'name': 'tom', 'age': 10}