'''
集合(set)
以大括号为标识,数据之间用逗号和逗号隔开
变量名 = {值,'值',...}   变量名 = set(数据)
特点 : 1.可变的
      2.无序的
      3.不可重复的
      4.不支持索引
      5.不支持切片
注意:创建空集合,,前需要加set,不加为字典
'''
# a={}
# print(type(a))  #dict
# b=set()
# print(type(b))  #set


# a={10,10,20,30,40,10,50}
# #1)add --- 集合里面添加一个数据,只能添加一个
# a.add('qewr')
# print(a)                #{40, 10, 50, 20, 'qewr', 30}


#2)update --- 往集合里面添加一共序列  通过列表,元组的方式都可以添加进去，添加重复数据无效不报错
# a={10,10,20,30,40,10,50}
# a.update(['q','w',])
# print(a)              #{'q', 'w', 40, 10, 50, 20, 30}


#删除  remove     discard      pop
#3)remove() --- 删除指定的数据,删除的数据不存在则报错
# a={10,10,20,30,40,10,50}
# a.remove(10)
# print(a)            #{40, 50, 20, 30}

#4)discard() --- 删除之指定的数据,数据不存在不报错
# a={10,10,20,30,40,10,50}
# a.discard(10)
# print(a)
# a.discard(1)           #删除不存在的数据不报错不进行任何操作
# print(a)               #将原来的数据再次输出

#5)pop() --- 随机删除一个,集合中不存在下标所以没办法删除下标的位数所以为随机删除
# a={10,10,20,30,40,10,50}
# a.pop()
# print(a)                #随机删除一个的数据结果

#6)in not...in.... --- 判断某个数据在不在...里
# a={10,10,20,30,40,10,50}
# print(10 in a)            # True
# print(100 in a)           # False